```sh
$ terraform apply
google_compute_network.vpc_network: Refreshing state... [id=projects/learn-terraform-gcp-tutorial/global/networks/foonet]
google_compute_instance.vm_instance: Refreshing state... [id=projects/learn-terraform-gcp-tutorial/zones/us-central1-c/instances/foovm]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.vm_instance must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
      ~ cpu_platform         = "Intel Haswell" -> (known after apply)
      ~ current_status       = "RUNNING" -> (known after apply)
      - enable_display       = false -> null
      ~ guest_accelerator    = [] -> (known after apply)
      ~ id                   = "projects/learn-terraform-gcp-tutorial/zones/us-central1-c/instances/foovm" -> (known after apply)
      ~ instance_id          = "4200456659746877353" -> (known after apply)
      ~ label_fingerprint    = "42WmSpB8rSM=" -> (known after apply)
      - labels               = {} -> null
      - metadata             = {} -> null
      ~ metadata_fingerprint = "S4FG8qnvHjM=" -> (known after apply)
      + min_cpu_platform     = (known after apply)
        name                 = "foovm"
      ~ project              = "learn-terraform-gcp-tutorial" -> (known after apply)
      - resource_policies    = [] -> null
      ~ self_link            = "https://www.googleapis.com/compute/v1/projects/learn-terraform-gcp-tutorial/zones/us-central1-c/instances/foovm" -> (known after apply)
        tags                 = [
            "dev",
            "web",
        ]
      ~ tags_fingerprint     = "XaeQnaHMn9Y=" -> (known after apply)
      ~ zone                 = "us-central1-c" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/learn-terraform-gcp-tutorial/zones/us-central1-c/disks/foovm" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-11-bullseye-v20230306" -> "cos-cloud/cos-stable" # forces replacement
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          + ipv6_access_type   = (known after apply)
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/learn-terraform-gcp-tutorial/global/networks/foonet" -> "foonet"
          ~ network_ip         = "10.128.0.2" -> (known after apply)
          - queue_count        = 0 -> null
          ~ stack_type         = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/learn-terraform-gcp-tutorial/regions/us-central1/subnetworks/foonet" -> (known after apply)
          ~ subnetwork_project = "learn-terraform-gcp-tutorial" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.69.71.53" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart           = true -> (known after apply)
          + instance_termination_action = (known after apply)
          ~ min_node_cpus               = 0 -> (known after apply)
          ~ on_host_maintenance         = "MIGRATE" -> (known after apply)
          ~ preemptible                 = false -> (known after apply)
          ~ provisioning_model          = "STANDARD" -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_compute_instance.vm_instance: Destroying... [id=projects/learn-terraform-gcp-tutorial/zones/us-central1-c/instances/foovm]
google_compute_instance.vm_instance: Still destroying... [id=projects/learn-terraform-gcp-tutorial/zones/us-central1-c/instances/foovm, 10s elapsed]
google_compute_instance.vm_instance: Still destroying... [id=projects/learn-terraform-gcp-tutorial/zones/us-central1-c/instances/foovm, 20s elapsed]
google_compute_instance.vm_instance: Destruction complete after 21s
google_compute_instance.vm_instance: Creating...
google_compute_instance.vm_instance: Still creating... [10s elapsed]
google_compute_instance.vm_instance: Still creating... [20s elapsed]
google_compute_instance.vm_instance: Still creating... [30s elapsed]
google_compute_instance.vm_instance: Still creating... [40s elapsed]
google_compute_instance.vm_instance: Creation complete after 43s [id=projects/learn-terraform-gcp-tutorial/zones/us-central1-c/instances/foovm]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
$
```